#################
# 2. Физические константы
#################

ct = {
    "qe": 1.6e-19,  # Заряд электрона [Кл]
    "me": 9.11e-31, # Масса электрона [кг]
    "Mi": 6.6335209e-26 - 9.1093837e-31,  # Масса иона Ar [кг]
    "eps_0": 8.85e-12,  # Диэлектрическая постоянная [Ф/м]
    "k_B": 1.380649e-23  # Постоянная Больцмана [Дж/К]
}

#################
# 1. Параметры рабочей точки ВЧ разряда
#################

default_config = {
    "name": "default",
    "comment": "Default configuration",
    "Vm":  180,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  1.25e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 5.7e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 501e-12,
    "val_C_m2": 128.37e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.01,
    "val_C_stray": 350e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 5e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC1_config = {
    "name": "PC1",
    "comment": "Пример #1 из статьи [Schmidt] p=0.66 Pa",
    "Vm":  100,                            # Амплитуда ВЧ источника [V]
    "f0":  13.56e6,
    "p0":  0.66,
    "T0":  300,                            # Температура буферного газа [К]
    "ne":  1.25e+15,                       # Начальное приближение плотности электронов [м^-3]
    "l_B": 5.7e-2,                         # Толщина bulk плазмы [м]
    "Ae": 0.01,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.03,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 100e-12,
    "val_C_m2": 175e-12,
    "val_L_m2": 1500e-9,
    "val_R_m":  0.5,
    "val_C_stray": 200e-12,
    "val_R_stray": 0.5,
    "matching_flag": True,                # Флаг включения итераций согласования
    "eps_ne": 5e12,                        # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": True                 # Отладочные графики
}

LC2_config = {
    "name": "PC2",
    "comment": "Пример из статьи 200 Pa",
    "Vm":  100,                            # Амплитуда ВЧ источника [V]
    "f0":  13.56e6,
    "p0":  200,
    "T0":  300,                            # Температура буферного газа [К]
    "ne":  1.25e+15,                       # Начальное приближение плотности электронов [м^-3]
    "l_B": 5.7e-2,                         # Толщина bulk плазмы [м]
    "Ae": 0.01,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.03,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 100e-12,
    "val_C_m2": 175e-12,
    "val_L_m2": 1500e-9,
    "val_R_m":  0.5,
    "val_C_stray": 200e-12,
    "val_R_stray": 0.5,
    "matching_flag": True,                # Флаг включения итераций согласования
    "eps_ne": 1e12,                        # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                 # Отладочные графики
}

LC3_config = {
    "name": "PC3",
    "comment": "ДТР 366 см2 симметрично 10 см 81.36 МГц 100 Вт 3 Па",
    "Vm":  200,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  1.25e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 622.85e-12,
    "val_C_m2": 127.28e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.01,
    "val_C_stray": 350e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC4_config = {
    "name": "PC4",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 100 Вт 1 Па",
    "Vm":  200,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  1,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  1.25e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 681e-12,
    "val_C_m2": 125e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC5_config = {
    "name": "PC5",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 1 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  1,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  1.25e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 758.1e-12,
    "val_C_m2": 123.4e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC6_config = {
    "name": "PC6",
    "comment": "АС 100 см2 симметрично 10 см 81.36 МГц 100 Вт 3 Па",
    "Vm":  200,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  4.2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.01,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.05,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 323.50e-12,
    "val_C_m2": 239.82e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 88e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC7_config = {
    "name": "PC7",
    "comment": "Статья Andries 13.56",
    "Vm":  100,                              # Амплитуда ВЧ источника [V]
    "f0":  13.56e6,
    "p0":  6,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 130e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.019,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.019,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 564e-12,
    "val_C_m2": 159e-12,
    "val_L_m2": 1500e-9,
    "val_R_m":  0.05,
    "val_C_stray": 88e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 3e15,                            # Критерий сходимости расчета ne
    "max_iter_ne": 40,
    "verbose_plots": False                   # Отладочные графики
}

LC8_config = {
    "name": "PC8",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 3 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 678e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC9_config = {
    "name": "PC9",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 4.5 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  4.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC91_config = {
    "name": "PC9-1",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 4 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  4,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC92_config = {
    "name": "PC9-2",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 3.5 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC92_config = {
    "name": "PC9-2",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 3 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC93_config = {
    "name": "PC9-3",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 2.5 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC94_config = {
    "name": "PC9-4",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 4.5 Па",
    "Vm":  230,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  4.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC95_config = {
    "name": "PC9-5",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 4 Па",
    "Vm":  230,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  4,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC96_config = {
    "name": "PC9-6",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 3.5 Па",
    "Vm":  230,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC97_config = {
    "name": "PC9-7",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 3 Па",
    "Vm":  230,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC98_config = {
    "name": "PC9-8",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 2.5 Па",
    "Vm":  230,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC99_config = {
    "name": "PC9-9",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 4 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  4,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC991_config = {
    "name": "PC9-91",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 4.5 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  4.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC992_config = {
    "name": "PC9-92",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 225 Вт 5 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC993_config = {
    "name": "PC9-93",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 5.5 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  5.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC994_config = {
    "name": "PC9-94",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 6 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  6,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC995_config = {
    "name": "PC9-95",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 6.5 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  6.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC996_config = {
    "name": "PC9-96",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 7 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  7,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC997_config = {
    "name": "PC9-97",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 8 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  8,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC998_config = {
    "name": "PC9-98",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 3 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  3,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC999_config = {
    "name": "PC9-99",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 2 Па",
    "Vm":  170,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC9991_config = {
    "name": "PC9-991",
    "comment": "ДТР 500 см2 симметрично 10 см 78.36 МГц 72 Вт 4.5 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  78.36e6,
    "p0":  4.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC9992_config = {
    "name": "PC9-9992",
    "comment": "ДТР 500 см2 симметрично 10 см 78.36 МГц 72 Вт 2.5 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  78.36e6,
    "p0":  2.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC9993_config = {
    "name": "PC9-9993",
    "comment": "ДТР 500 см2 симметрично 10 см 81.36 МГц 72 Вт 4 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  83.36e6,
    "p0":  4,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 500e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC10_config = {
    "name": "PC10",
    "comment": "ДТР 366 см2 l=1 симметрично 10 см 81.36 МГц 225 Вт 2.7 Па",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2.7,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 550.06e-12,
    "val_C_m2": 131.21e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.1,
    "val_C_stray": 350e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 6e14,                            # Критерий сходимости расчета ne
    "max_iter_ne": 30,
    "verbose_plots": False                   # Отладочные графики
}

LC9994_config = {
    "name": "PC9-9994",
    "comment": "ДТР 366 см2 симметрично 10 см 81.36 МГц 225 Вт 4.5 Па",
    "Vm":  200,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2.5,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  2e+16,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0366,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0366,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 641e-12,
    "val_C_m2": 123.5e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 350e-12,
    "val_R_stray": 0.03,
    "matching_flag": True,                   # Флаг включения итераций согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC100_config = {
    "name": "PC10-0",
    "comment": "Макет M1 462 см2 симметрично 10 см 81.36 МГц 2.45 Па 154.10+62.81+7.73=224.65 [W]",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  81.36e6,
    "p0":  2.45,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  44e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0462,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0462,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 653.99e-12,
    "val_C_m2": 123.74e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 410e-12,
    "val_R_stray": 0.05,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC101_config = {
    "name": "PC10-1",
    "comment": "Макет M1 462 см2 симметрично 10 см 80.36 МГц 2.45 Па 154.21+62.71+7.89=224.81 [W]",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  80.36e6,
    "p0":  2.45,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  44e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0462,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0462,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 660.36e-12,
    "val_C_m2": 127.66e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 410e-12,
    "val_R_stray": 0.05,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC102_config = {
    "name": "PC10-2",
    "comment": "Макет M1 462 см2 симметрично 10 см 75 МГц 2.45 Па [W]",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  75e6,
    "p0":  2.45,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  44e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0462,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0462,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 701.84e-12,
    "val_C_m2": 152.53e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 410e-12,
    "val_R_stray": 0.05,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC103_config = {
    "name": "PC10-3",
    "comment": "Макет M1 462 см2 симметрично 10 см 70 МГц 2.45 Па [W]",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  70e6,
    "p0":  2.45,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  44e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0462,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0462,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 746.27e-12,
    "val_C_m2": 183.53e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 410e-12,
    "val_R_stray": 0.05,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC104_config = {
    "name": "PC10-4",
    "comment": "Макет M1 462 см2 симметрично 10 см 60 МГц 2.45 Па [W]",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  60e6,
    "p0":  2.45,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  37e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0462,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0462,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 853.09e-12,
    "val_C_m2": 288.57e-12,
    "val_L_m2": 40e-9,
    "val_R_m":  0.05,
    "val_C_stray": 410e-12,
    "val_R_stray": 0.05,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}

LC105_config = {
    "name": "PC10-5",
    "comment": "Макет M1 462 см2 симметрично 10 см 50 МГц 2.45 Па [W]",
    "Vm":  300,                              # Амплитуда ВЧ источника [V]
    "f0":  50e6,
    "p0":  2.45,
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  33e+15,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.0462,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.0462,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 1000e-12,
    "val_C_m2": 100.38e-12,
    "val_L_m2": 200e-9,
    "val_R_m":  0.05,
    "val_C_stray": 410e-12,
    "val_R_stray": 0.05,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 20,
    "verbose_plots": False                   # Отладочные графики
}


LC205_config = {
    "name": "PC20-5",
    "comment": "Макет d80 симметрично 10 см 63.9 МГц 1.6 Па [W]",
    "Vm":  100,                              # Амплитуда ВЧ источника [V]
    "f0":  13e6,                           # Частота ВЧ источника [Гц]
    "p0":  3.6,                             # Давление буферного газа [Па]
    "T0":  300,                              # Температура буферного газа [К]
    "ne":  1e+14,                         # Начальное приближение плотности электронов [м^-3]
    "l_B": 10e-2,                           # Толщина bulk плазмы [м]
    "Ae": 0.005,                            # Площадь нагруженного электрода [м^2]
    "Ag": 0.009,                            # Площадь заземленного электрода [м^2]
    "val_R_rf": 50,
    "val_C_m1": 436e-12,
    "val_C_m2": 295e-12,
    "val_L_m2": 80e-9,
    "val_R_m":  0.05,
    "val_C_stray": 75e-12,
    "val_R_stray": 0.013,
    "matching_flag": True,                   # Флаг включения итераций ВЧ согласования
    "eps_ne": 1e13,                            # Критерий сходимости расчета ne
    "max_iter_ne": 100,
    "verbose_plots": True                   # Отладочные графики
}

#global config
cf = LC1_config

# Размер зеркала макета М1: 250х185 -> площадь 0.0462 м2, емкость при d=1 мм: 410 пФ
# Значения Rm и Rstray примерно соответствуют расчетам СУ с потерями